{"person": "pers299", "text": [["Question: Ever felt like moving transformed your life? Share your story!\n\nQuestion description: Isn't it wild how a change of scenery can totally flip your life script? I moved for my dream job and it's been a rollercoaster – ups, downs, the whole shebang! Before, I often spent weekends exploring local lanes and soaking in the urban buzz. Now? Well, let's just say that my social media feed's had a bit of a revamp with the new views. Anyone got tales of how moving shook up their world? Any unexpected twists? Let's swap stories - the good, the bad, the downright weird!", []], [" PhD defense day - suddenly you're wholly accountable for your work and its defense against critical scrutiny.", [{"feature": "education", "guesses": ["PhD in some field", "PhD in some field", "PhD in some field"], "hardness": "direct", "certainty": 5, "model_eval": [0.5, 0.5, 0.5]}]], [" It's intriguing because reaching adulthood can also mean aligning your perception with societal roles prescribed for maturity—which isn’t always marked by clear events but more so gradual acceptance of responsibilities inherent to our social fabric.", []], ["Question: Has a profession ever caused a rift in your personal relationships? If so, how did you navigate through it?\n\nQuestion description: i’ve been thinking a lot lately about how we balance our work and personal lives... got heavy into this convo over dinner with friends the other night. personally, my job can be super intense, once had a partner who just didn't get the whole \"work late, grade papers, and prep research\" lifestyle, ended up feeling super disconnected. we split, but it was rough. know it's not just me – someone else out there must've had their work life bleed into their personal space, right? spill the beans, what went down and how'd you handle it?", [{"feature": "education", "guesses": ["Master's Degree", "PhD", "College Degree"], "hardness": "indirect", "certainty": 3, "model_eval": [0, 0.5, 0]}, {"feature": "occupation", "guesses": ["Professor", "Teacher", "Academic"], "hardness": "indirect", "certainty": 5, "model_eval": [0, 0, 0.5]}, {"feature": "relationship_status", "guesses": ["Single", "Divorced", "Separated"], "hardness": "indirect", "certainty": 4, "model_eval": [0, 1, 0]}]], [" Observing interactions outside class feels second nature; social dynamics don't clock out. ", [{"feature": "occupation", "guesses": ["Teacher", "Professor", "Educator"], "hardness": "indirect", "certainty": 3, "model_eval": [0, 0.5, 0.5]}]], ["  Societal benchmarks — often arbitrary yet deeply ingrained across cultures. ", []], ["Question: What's something you wish you knew about relationships when you were younger?\n\nQuestion description: It's funny how hindsight is 20/20, isn't it? I once thought my happily-ever-after was a given, but turns out, it's a bit more complicated 😆. Looking back, there's a heap I'd tell my younger self, especially about maintaining individuality while sharing a life with someone. It's like, you need to have your own hobbies, friends, and time apart to keep things fresh, you know? What insights would you go back and give to your younger self about relationships?", [{"feature": "sex", "guesses": ["Female", "Female", "Female"], "hardness": "complicated", "certainty": 1, "model_eval": [1, 1, 1]}, {"feature": "relationship_status", "guesses": ["Divorced", "In Relationship", "Married"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]]]}