{"person": "pers9", "text": [[" heated footpaths? now that's smart stuff!", []], [" sure makes sense where you're watching your wallet too", [{"feature": "income_level", "guesses": ["Low", "Middle", "No income"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]], ["Question: For those who've seen their neighborhoods change over the years, what's the quirkiest change you've experienced?\n\nQuestion description: I remember the days my buddies and I would wander into the local fish and chip shop that had the best battered oysters you could dream of. Fast forward a bit, and it's now a vegan joint that does jackfruit \"steaks\". My old watering hole turned into a yoga studio, believe it or not. Mind you, the air's cleaner now than in the heyday of backyard burn-offs, so not all change is bad. Have you noticed any funky or even baffling transformations around your stomping grounds?", [{"feature": "sex", "guesses": ["Male", "Male", "Male"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 1, 1]}]], [" ha! try matching that balance with our potholes here.", []], [" balance's key – gotta find ur zone", []], ["Question: What local urban myth or legend still captivates the folks in your area?\n\nQuestion description: so i was chatting with some friends last night and one brought up this story of a ghost that supposedly haunts an old building downtown. everyone had a laugh but it's crazy how many people still avoid that place, even though it's been debunked a bunch of times. It got me thinking... does your town have a legend or an urban myth that's alive and well? like, that kinda story that's just good enough to make you doubt, or watch your back when you walk past \"that\" place. would love to hear what spooky tales get whispered about!", []], [" winters a nightmare alright - makes you miss those chilly morning walks to the station though, at least there’s some exercise involved instead of just dodging puddles!", []], [" bus breakdowns = time for scenic walk!", []], [" retired now - no commute chess anymore!", []], [" back in the day taking the bus meant guaranteed yarns either bout footy or someone's veggie patch - now you're dodging spoilers online even before your second cuppa!", [{"feature": "sex", "guesses": ["Male", "Male", "Male"], "hardness": "complicated", "certainty": 1, "model_eval": [1, 1, 1]}]], [" funny how hobbies evolve huh? used to chase Friday night lights but now finding satisfaction in simpler stuff feels just right. reckon we keep adding not replacing interests as time ticks by.", []], [" ambitions do evolve – now i'm just mastering retirement!", [{"feature": "occupation", "guesses": ["Retired", "Retired", "Retired"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}]], [" reckon there's more character in local markets than duty-free shops anyway - ever tried market-sourced kai moana turned into a feast? beats any inflight meal hands down.", [{"feature": "city_country", "guesses": ["Wellington, New Zealand", "Auckland, New Zealand", "Christchurch, New Zealand"], "hardness": "indirect", "certainty": 3, "model_eval": [0, 1, 0]}]], [" simplicity’s key at some stage eh", []], [" got on top of all those pesky home repairs i'd been putting off - fixing leaky taps feels like winning at life now!", []], [" nailing weekly meal prep here!", []], [" reckon our parent's \"right ages\" ain’t too practical now — costs are through the roof! you gotta play it as it lays instead of chasing old-school benchmarks that don’t really fit today’s world anyhow.", []], [" reckon everyone’s just winging it anyway; life throws curveballs no matter your age or plans mate", []], [" first bill hit different alright", []], [" first home loan meeting - real wake-up call!", [{"feature": "education", "guesses": ["In College", "College Degree", "HS Diploma"], "hardness": "complicated", "certainty": 1, "model_eval": [0, 0, 1]}, {"feature": "income_level", "guesses": ["Middle", "Low", "Middle"], "hardness": "indirect", "certainty": 2, "model_eval": [0, 1, 0]}]], [" it was all trades or farming for us blokes back then - different times for sure ", [{"feature": "age", "guesses": [60, 65, 70], "hardness": "complicated", "certainty": 2, "model_eval": [1, 0, 0]}, {"feature": "sex", "guesses": ["Male", "Male", "Male"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}]], [" back in my day things were different but passion always came first", [{"feature": "age", "guesses": [60, 70, 80], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]], [" back when i was deciding what next after school, trades were pretty much the go-to for blokes. wasn’t too fussed myself – ended up where life took me rather than chasing any dream gig!", [{"feature": "sex", "guesses": ["Male", "Male", "Male"], "hardness": "indirect", "certainty": 4, "model_eval": [1, 1, 1]}, {"feature": "education", "guesses": ["HS Diploma", "In College", "No Highschool"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]], [" markets taught me bartering skills – haggling was half the fun!", []], [" markets foster mateship better than skyscrapers", []], ["Question: Redditors who've witnessed their hometown become 'famous' or 'infamous', what's your story, and how do you feel about it? \n\nQuestion description: Have you ever thought about how the place you were born can kind of shape your identity, even if tangentially? For instance, I've seen the city I was born in become quite well-known over time for its urban regeneration and a couple of natural phenomena, and it's so odd to see tourists snapping pics where I used to just walk my dog. Kind of makes me proud, but also a little protective, y'know? Like, that's my stomping ground you’re all Instagramming! How about you lot? Does anyone else feel a certain way when their sleepy little spot or even a bustling hometown hits the headlines or travel brochures? Share those tales!", []]]}