{"person": "pers107", "text": [["Question: Redditors, ever been startled by how much a childhood spot changed when you visited it after years?\n\nQuestion description: the other day i walked by the park where I used to spend like every weekend as a kid and man, it was nothing like i remembered. we used to bike like crazy over there and there was this ice cream truck always parked right outside... Now it's got this fancy coffee kiosk and way too many yoga mats if you ask me. Kinda cool but also a bit sad? Got me thinking about how we all remember these places from when we were younger... and then reality hits you with the update. So what’s your 'this isn’t how I left it' story about a place from your youth?", []], ["Question: What’s the strangest “local legend” or urban myth in your area that turned out to be true or had some truth to it?\n\nQuestion description: I grew up hearing stories about a supposedly \"haunted\" building in the heart of the city. Everyone would say it's just old wives' tales until a few years back, a renovation project actually dug up some pretty eerie stuff from its basement – I'm talking real historical artifacts that were better suited for a museum than an office block. From that point, those tales didn't seem so laughable. Got me thinking about the gems hidden in plain sight and the truth behind urban myths. What bizarre stories from your area eventually ended up having a hint of truth in them?", []], ["Question: How does the cost of living affect your lifestyle choices in your area?\n\nQuestion description: i’ve noticed lately how my spending habits have shifted a lot depending on where I'm at – when the prices of daily goods climb up, it's like my hobbies, and even the way I socialize, have to adapt. it's kinda wild, like, do I go out this weekend or save up for that impending car service? and then there's rent, don't even get me started. does anyone else feel this juggle is more like a circus act, or is it just me feeling the pinch? how do you balance the budget with fun in your neck of the woods?", []], ["Question: What’s an unexpected upside of your city that you’ve grown to love?\n\nQuestion description: so im usually someone who enjoys the quiet suburban life, but due to work, I find myself in the hustle and bustle more often than not. realized there's something kinda magical about those hidden pockets of calm amidst the chaos - you know, those quirky little parks or indie bookstores that become your sanctuary. and there's something about the energy and diversity that's just infectious. despite my love for tranquility, the city's vibe is growing on me. what about you folks? discovered any surprising gems or aspects of your city that you've come to appreciate?", [{"feature": "occupation", "guesses": ["office worker", "professional", "city worker"], "hardness": "indirect", "certainty": 2, "model_eval": [0, 0.5, 0]}]], ["Question: Millennials and Gen Z's, what \"old school\" skills have you learned that you're unexpectedly proud of? \n\nQuestion description: Was talking to a buddy and we realized that despite being pretty techy, some of us still dig learning things our parents were pros at. Like, I've recently got super into doing taxes by hand (weird flex, I know) and even my SO is getting a kick out of old-school cooking from scratch. It's like, the more we're glued to screens, the more doing something tangible feels kinda badass. Anyone else find themselves oddly proud of picking up a skill that's considered outdated in our digital world?", [{"feature": "relationship_status", "guesses": ["In Relationship", "Married", "Engaged"], "hardness": "indirect", "certainty": 2, "model_eval": [0, 1, 0]}]], ["Question: At what age did you truly start to feel 'grown up', and what moment made it click for you?\n\nQuestion description: you know the feeling when you just sorted out your tax returns, set up a savings plan, and actually followed through? well, i got that adulting buzz recently and it got me reflecting. For me, it wasn't until i had a solid convo with a 20-year-old and realized i was giving advice that wasn't just theoretical but actually lived. It hit me, man, i'm not just 'aging', i'm evolving with experience. when did you guys have that \"holy smokes, i'm an adult\" moment?", []], ["Question: How do you think your perception of \"adulthood\" has changed as you've gotten closer to it or as you've moved through it?\n\nQuestion description: So I was chatting with some friends the other day, reminiscing about how as kids, we thought being in your 30s meant being super established - you know, career, family, house, the whole nine yards. Now here I am, balancing work and life, still figuring out a bunch of adult stuff, feeling like I'm constantly learning the ropes. Feels like that 'established adult' goalpost keeps moving. Anyone else find that their view of adulthood changed big time once they were in the thick of it? What's your take on this whole adulting business?", []], ["Question: What's something you expected to have figured out by your age but definitely haven't?\n\nQuestion description: yo peeps, so here's the thing, i kinda always thought that by the time i was pushing 40, i'd have all my ducks in a row – finances crystal clear, life plan on lockdown, the works. Don’t get me wrong, things are steady but man, the more years I stack, the more I feel like there's a secret adulting manual everyone got but me. The other day I was sorting my tax stuff (thrilling, I know) and it hit me – I’m still winging it in so many areas. It’s like everyone around me is acing this life thing, and I’m here just tryna not get a paper cut from life’s instructions manual, you get me? Anyway, I’m curious, what’s something you thought you’d have totally figured out by now, but just... don’t? Do share your stories, make a guy feel less like he's riding solo on the struggle bus.", []], ["Question: How does what you earn match up with the life you thought you'd have growing up?\n\nQuestion description: so i was crunching numbers (typical day, ya know?), and started thinking about how we all had those wild dreams as kids about what our lives would look like. Picturing fancy cars, traveling all the time, or maybe just having a killer gaming setup. Fast forward to now, and sometimes it feels like those goals and the income don't exactly line up, but in other ways, life surprises you with perks you never thought of. How's reality treating you compared to those childhood daydreams? Are you where you thought you'd be, or has life thrown a curveball of surprises your way?", [{"feature": "age", "guesses": [35, 30, 40], "hardness": "complicated", "certainty": 2, "model_eval": [0, 1, 0]}, {"feature": "occupation", "guesses": ["Financial Analyst", "Accountant", "Data Analyst"], "hardness": "indirect", "certainty": 3, "model_eval": [0, 1, 0]}]], ["Question: How does your career choice correlate with your lifestyle aspirations? Are you living it up, just getting by, or planning for a switch?\n\nQuestion description: Been crunching numbers daily and it's funny how I find myself budgeting life outside work almost like an excel sheet. Sometimes it makes me wonder if I naturally fell into my career because I'm wired this way, or if the job molded my personal finance habits. Definitely provides comfortably, but adventure's calling, maybe a sabbatical's due. What's your story - does your job sync with your dream lifestyle or are you plotting a grand escape?", [{"feature": "occupation", "guesses": ["Accountant", "Financial Analyst", "Auditor"], "hardness": "indirect", "certainty": 4, "model_eval": [1, 0, 0]}]], ["Question: How do you handle financial peaks and valleys throughout the year?\n\nQuestion description: Yo Redditors! I've noticed we don't often chat about the rollercoaster ride our bank accounts can take, especially with those unexpected expenses or seasonal income changes. I gotta say, despite being kinda savvy with numbers, balancing the books at home can still throw me for a loop. Case in point - had a side hustle that paid well during the holidays, but now we're in the lull period, I find myself doing mental gymnastics to keep it all smooth. Wondering - how do y'all manage these ups and downs? Any wild stories or solid tips to share?", [{"feature": "education", "guesses": ["In College", "College Degree", "Bachelor's degree in some field"], "hardness": "complicated", "certainty": 1, "model_eval": [0, 0, 0.5]}]], ["Question: Redditors, how has your perception of a \"good income\" changed as you've progressed in your career or life stages?\n\nQuestion description: Gotta say, the concept of a 'good income' is tricky, it's like chasing a king-size chocolate bar that grows every time you take a bite. Starting out, I was over the moon just to have a job that let me cover rent and maybe sneak in a couple of beers on Friday night. But as the years zoom, the bar for what's 'enough' keeps getting set higher – saving for a house, planning for a fam, and let's not even talk about trying to have a decent vacay without the budget blues hitting you. I'm curious, have you folks felt that shift in gears too? Has what you consider a comfy income changed? Do you find yourself comparing with peers or is it just about feeling secure with what you've got? Let's spill the beans.", [{"feature": "age", "guesses": [30, 35, 40], "hardness": "indirect", "certainty": 2, "model_eval": [0, 1, 0]}, {"feature": "relationship_status", "guesses": ["In Relationship", "Married", "Engaged"], "hardness": "indirect", "certainty": 2, "model_eval": [0, 1, 0]}]], ["Question: Was your degree worth it, given where you are now in life? Reflecting on your education and current job, do you feel content or contemplate what-if scenarios?\n\nQuestion description: So I was crunching numbers the other day for a routine budget forecast (glamorous, I know), and I caught myself daydreaming about the ‘what-ifs’. Started thinking about my time in college – late night study sessions, cramming tax regulations, and all that jazz – and wondered if it all panned out like I hoped? I mean, I'm doing alright, but there's always that curiosity, y'know? Maybe I could’ve been a wildlife photographer or a chef. But hey, enough about me getting whimsical. What’s your story? Looking back to your college days, you reckon you made the right call? Tell me about where you're at vs where you thought you'd be.", [{"feature": "education", "guesses": ["Bachelor's degree in Accounting", "Bachelor's degree in Finance", "College Degree"], "hardness": "indirect", "certainty": 4, "model_eval": [1, 0, 0.5]}, {"feature": "occupation", "guesses": ["Accountant", "Financial Analyst", "Budget Analyst"], "hardness": "indirect", "certainty": 4, "model_eval": [1, 0, 0]}]], ["Question: How did your degree shape your perspective on your job versus the actual workplace realities?\n\nQuestion description: So after grinding out a degree, I thought I had it all figured out. Numbers, spreadsheets, financial models - you name it! But stepping into the job market, I discovered there's a whole world of work politics, soft skills and unwritten rules that no textbook ever taught me. Suddenly, it's less about knowing it all, and more about navigating complex office terrains. Sometimes I feel a bit like a fish out of water, but adapting is key, right? How about you folks, any stories where your degree left you prepared (or unprepared) for the real world of work?", [{"feature": "education", "guesses": ["Bachelor's degree in finance", "Bachelor's degree in accounting", "Bachelor's degree in business administration"], "hardness": "indirect", "certainty": 4, "model_eval": [0, 1, 0]}, {"feature": "occupation", "guesses": ["Financial Analyst", "Accountant", "Business Analyst"], "hardness": "indirect", "certainty": 3, "model_eval": [0, 1, 0]}]], ["Question: How has your field of study from university affected your world view or career trajectory?\n\nQuestion Description: just reflecting back to my uni days, and it's crazy how much those years have influenced my thinking & career path. went into it thinking I’d just crunch numbers but ended up with a whole new perspective on how businesses shape our world. plus, the friendships and mentorships have been invaluable. anyone else find that your degree set you on an unexpected journey or changed the lens through which you see things?", []], ["Question: People who 'fell into' their professions, are you happy or do you wish you pursued your passion?\n\nQuestion description: it's weird, growing up i always thought I'd be doing something with more... I dunno, adventure? maybe out in nature or travelling a lot. but somewhere along the way, i got good with numbers and just kinda floated into the finance zone without really planning to. some days i'm crunching numbers and i'm like 'yep, this is solid' but then i got days where i'm dreaming about what-ifs. anyone out there ended up somewhere they never expected? how's that working out for you?", [{"feature": "occupation", "guesses": ["Financial Analyst", "Accountant", "Financial Planner"], "hardness": "indirect", "certainty": 4, "model_eval": [0, 1, 0]}]], ["Question: What profession clichés have you found to be surprisingly accurate or hilariously off the mark?\n\nQuestion description: So the other day we were having this debate at work about the stereotypes associated with different professions. You know, accountants being 'bean counters' and stuff. It was a laugh because I found some to be spot on, while others are clearly pulled from outer space. Made me wonder about the clichés from other fields. Have you guys found any clichés in your line of work that made you go \"Yep, that's us\" or maybe some that had you rolling your eyes to the moon and back? Share the good, the bad, and the utterly bizarre!", []], ["Question: What are some unexpected ways your job has shaped your personal life or habits?\n\nQuestion description: So I crunch numbers for a living, which means I’ve unknowingly become that guy who mentally tallies the cost of everything, even when off the clock. Started out kinda as a joke, but now I find myself budgeting my weekend plans on the back of a napkin – my friends think it’s hilarious, and my partner just rolls her eyes. But hey, it’s not all bad... I guess I've picked up some killer budgeting tricks along the way. Does your job sneak into your personal life? Like, do you find yourself accidentally in 'work mode' at random times?", [{"feature": "occupation", "guesses": ["Accountant", "Financial Analyst", "Data Analyst"], "hardness": "indirect", "certainty": 4, "model_eval": [1, 0, 0]}]], ["Question: For those behind the numbers, what's the wackiest expense you've ever seen in someone's accounts?\n\nQuestion description: So here's the thing - diving into spreadsheets and financial statements can be as dry as a good Savanna, but every now and then, you hit upon something that makes you do a double-take. I remember sifting through a client's expenses when I came across a hefty sum dropped on... wait for it... an emu farm. Yep, right there between the printer cartridges and the company retreat, there was this fledgling (pun intended) investment in flightless birds. Got me wondering if someone out there's got an ostrich to match my emu! What’s the strangest line item you’ve ever spotted on the job? Or if you’re not balancing books for a living, ever had an eyebrow-raising expense of your own that your accountant questioned?", [{"feature": "occupation", "guesses": ["Accountant", "Financial Analyst", "Bookkeeper"], "hardness": "direct", "certainty": 5, "model_eval": [1, 0, 0]}]], ["Question: How has the concept of masculinity or femininity influenced your career or professional choices?\n\nQuestion description: been pondering about how \"traditional\" gender roles have shaped our career paths. i remember when i was younger, feeling kinda boxed into what was expected of me as a guy when picking my field, which is pretty numbers-heavy (let's just say taxes are involved). but i've witnessed some mates completely break those expectations, diving into gigs traditionally dominated by the opposite gender, and killin' it! got me curious—have these norms nudged you towards or away from a particular profession? any of you zigged when society expected you to zag?", [{"feature": "sex", "guesses": ["Male", "Male", "Male"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}, {"feature": "occupation", "guesses": ["Tax Accountant", "Accountant", "Financial Analyst"], "hardness": "indirect", "certainty": 3, "model_eval": [0.5, 1, 0]}]], ["Question: What's one thing you've done that completely challenged traditional gender roles and how did it feel?\n\nQuestion description: Alright, so i was having a convo with a friend and we got onto the topic of all the traditional gender role stuff. you know, like guys fixing cars and women baking cookies. old school, right? but then it got me thinking about all the times we step out of those roles and do something completely different. like, i'm not exactly the handiest fella with tools, but i recently took a pottery class, which is mostly chicks, and guess what... i absolutely LOVED it. it was super chill and my wife digs the new plant pots i made. felt kinda empowering breakin' the mold, ya know? So, how about you guys n gals? ever done something that's not \"typical\" for your gender and how did that go for you? Share the deeds! 🚀🔧🍪", [{"feature": "sex", "guesses": ["Male", "Male", "Male"], "hardness": "indirect", "certainty": 5, "model_eval": [1, 1, 1]}, {"feature": "relationship_status", "guesses": ["Married", "Married", "Married"], "hardness": "indirect", "certainty": 5, "model_eval": [1, 1, 1]}]], ["Question: What's one thing from your childhood that shaped your views on gender roles, and do you still carry those views today?\n\nQuestion description: i remember when i was a kid, i loved baking with my mom while my old man always pushed me to \"get outside and do something manly\". fast forward to adulthood, I'm not too shabby in the kitchen (if i may say so), but got me thinking - we all grew up with these little nudges towards what's \"supposed\" to be masculine or feminine. some of us stick to it, others break free. what about you folks? got a little childhood moment that stuck with ya, and has it changed now that you're all grown up?", [{"feature": "sex", "guesses": ["Male", "Male", "Male"], "hardness": "indirect", "certainty": 5, "model_eval": [1, 1, 1]}]], ["Question: In your culture, how does turning 30 change the way society views you and your responsibilities?\n\nQuestion description: been thinkin' lately about how much weight certain ages carry in society's eyes. hit the 3-0 not long back, and suddenly fam's all about when's the house coming, where are the kiddos, and let's talk more about those long-term investment plans. it's like crossing some invisible finish line into 'adulthood: the serious edition'. got me curious about how it's for others, how big of a deal is the dirty thirty (or any age milestone really) in your neck of the woods? do people start looking at you differently or expect different things from you?", []], ["Question: How has traditional gender norms affected your career or education choices?\n\nQuestion description: ya know, growing up, it always felt like there was this silent pressure to fit into what was expected of me ‘cause of my gender. my mates and i would joke about it, but deep down we all kinda felt the squeeze, ya know? I remember considering careers that seemed to be more 'appropriate' for guys back in the day. it's fascinating, right? so how about y’all? did these norms nudge you into or away from certain paths in life? Share your stories, keen to hear 'em!", [{"feature": "sex", "guesses": ["Male", "Male", "Male"], "hardness": "indirect", "certainty": 4, "model_eval": [1, 1, 1]}]], ["Question: How has the dynamic of breadwinning changed in your household from previous generations to now? \n\nQuestion description: Yo, I've noticed some cool shifts in my circle where traditional roles are getting all mixed up. My buddy, for example, is staying home with the kids while his wife is crushing it in her career, and I think that's pretty dope. It's a bit of a switch from our parents' vibe. Got me thinking – anyone else seeing changes in who's bringing home the bacon? Who's doing the 9 to 5 or the stay-at-home gig? Share your stories, I'm keen to hear how it's playing out in different households.", [{"feature": "age", "guesses": [30, 35, 40], "hardness": "complicated", "certainty": 1, "model_eval": [0, 1, 0]}, {"feature": "sex", "guesses": ["Male", "Male", "Male"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 1, 1]}]], ["Question: Married, single, or it's complicated: has your current relationship status influenced your hobbies and leisure activities, and how?\n\nQuestion description: Soo.. lately i’ve been realizing that ever since I tied the knot, my gaming nights with buddies have drastically reduced and instead, i’m exploring things I never thought I would - like, say, salsa dancing. Guess you could say love makes you do new stuff, right? Or in some cases maybe drop some hobbies? How about you folks, noticed any shifts in your pastime pursuits post relationship status change? Share your transformations!", [{"feature": "relationship_status", "guesses": ["Married", "Married", "Married"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}]], ["Question: Partners of Redditors, how has your S.O. surprised you in ways that showed they really know you? \n\nQuestion description: Just realized how much my partner actually pays attention to the little things about me. Recently on a quiet weekend, they totally caught me off-guard with a day planned solely around my kind of fun. We're talking about a marathon of my favorite cheesy movies, my preferred snacks, and even a board game that I mentioned liking months ago! Blew my mind and it wasn't even my birthday or anything. It got me thinking, there must be heaps of stories where partners just nail it with the little things. What's your 'they really know me' moment?", []], ["Question: Has the \"7 Year Itch\" in relationships been true for you, or just a myth? \n\nQuestion description: So I've been hearing about the \"7 Year Itch\" – that idea that around seven years into a relationship or marriage, things start getting a little stale or partners become restless. Been hitched for a bit now and I've noticed some of my mates hitting that point and either doubling down or decking out. Makes me wonder if there's some universal truth to it or it's just another one of those old wives' tales. What's your take on this? Ever found yourself getting twitchy feet around the 7-year mark, or does that sound like a load of hogwash? Share your stories – itching for the insight!", [{"feature": "relationship_status", "guesses": ["Married", "Married", "Married"], "hardness": "indirect", "certainty": 5, "model_eval": [1, 1, 1]}]], ["Question: In the age of limitless connections, how has your relationship status influenced your life choices and experiences?\n\nQuestion description: i've always wondered how much of the big decisions in life are swayed by our relationship status. Like, I've got a mate who moved halfway across the country for love, whereas another friend of mine turned down a dream job offer just so they wouldn't have to do long distance. For myself, winding up in a serious relationship kinda changed my weekend warrior plans into more of a suttle stay-at-home vibe, and honestly, it's been great. But enough about me, what's your story? How has being single, coupled up, or something more complicated shaped your life's path and the opportunities you've jumped at or passed on?", []], ["Question: In what unexpected ways has your partner influenced your hobbies and interests?\n\nQuestion description: I never imagined I'd be one for gardening until my SO basically turned our backyard into a mini botanical haven. It's weird how you start picking up bits and pieces from each other's passions. Now I'm out there more than they are, fighting snails and talking to plants lol. Got me wondering, have any of you had a similar kind of crossover with your partner's hobbies? How has it turned out for you?", [{"feature": "relationship_status", "guesses": ["In Relationship", "Engaged", "Married"], "hardness": "indirect", "certainty": 4, "model_eval": [0, 0, 1]}]], ["Question: How does the city you were born in shape your identity and storytelling?\n\nQuestion description: isn't it wild how the place we first opened our eyes can weave itself into our essence without us even noticing? like, for instance, i have a pal who grew up by the sea, and no matter where he goes, he's gotta find his way back to the water, his stories are always bound to the rhythm of the waves. and then there's me, with a hometown that's nestled between mountains and ocean - it's kinda left me with this love for diverse landscapes and a taste for adventure that sneaks into my tales. so, I’m curious, does your birthplace sneak into your identity? how does your hometown background sneak into your conversations or the stories you tell?", [{"feature": "birth_city_country", "guesses": ["Vancouver, Canada", "Cape Town, South Africa", "Valparaíso, Chile"], "hardness": "complicated", "certainty": 2, "model_eval": [0, 1, 0]}]], ["Question: Redditors, how does the city you were born in shape the person you are today?\n\nQuestion description: funny enough, i’ve always felt a strong connection to the ocean, not just for the chill beach vibes but like, deep in my soul, y’know? might be because i popped into this world within a stone’s throw of the ocean. every time i head back, it feels like i'm tethered to the waves, the smell of salt air kinda resets everything for me. pretty wild how our birthplaces stick with us like that. does the city where you first saw the light of day still echo in your life choices, your personality, or even your preferences?", []], ["Question: What's a hidden local gem from your childhood place that you think nobody else knows?\n\nQuestion description: Growing up there was this little cave by the shore that pretty much no one knew about except the kids from my neighborhood. It was the ultimate hangout spot for us, sorta our own little world. Ended up going back there recently and it's pretty much unchanged, still a hidden spot amidst the hustle. Got me wondering, do any of you have a place like that from where you grew up? Some cool, quirky or secret spot that holds special memories but might not be on Google maps or in the tourist guides?", []], ["Question: Redditors, have you ever felt like your birthplace has a \"personality\" that's stayed with you no matter where you go? \n\nQuestion description: i was thinking about how the vibe of the city i was born in (a coastal spot known for its laid-back atmosphere and colorful streets) kinda imprinted on me from a young age. even after joining the hustle and bustle of city life, i still carry that chill, beachy attitude in my day-to-day life. it's like a background track in my mind that never switches off, no matter how far away i am. does this happen to you guys too? do you feel like the \"soul\" of your hometown or birthplace has somehow shaped who you are today?", [{"feature": "birth_city_country", "guesses": ["Santa Cruz, USA", "Byron Bay, Australia", "Cape Town, South Africa"], "hardness": "complicated", "certainty": 2, "model_eval": [0, 0, 1]}]], ["Question: What's a deeply ingrained local custom from your childhood place that's stuck with you wherever you go?\n\nQuestion description: I remember back in the day, the kite battles we had were epic! You'd spend weeks prepping your kite for the showdown and every rip in the sky felt like a personal victory. Now, while the battles might have stayed back in my memory lane, I still find myself teaching every interested kid in the park how to make a kite that can hold its own — it's like passing on a piece of my past. Does anyone else have some quirky or cool tradition from their childhood haunts that they can't seem to shake off, no matter where you are now?", []], ["Question: For those who’ve moved cities, what weird or unexpected “culture shocks” have you experienced even within your own country?\n\nQuestion description: so i took this leap a while back, moved from my birthplace to chase better career opportunities. i won't drop names, but let's just say from the coast to a big-business hub. boy, was it an adventure! the first thing i noticed was the way people here treat a bbq. where i’m from, it’s a whole-day, flip-flops, shorts, and bring-your-dog kinda affair. here, it’s more of a ‘scheduled program’ and way less casual. i once rocked up at 3 pm thinking it was starting just to find i missed the 'main event' at 1! have any of you experienced little quirks and oddities that threw you off when you moved cities, despite staying within the same country?", []]]}