{"person": "pers200", "text": [[" Dudes, thought thin walls were bad until karaoke night became every night next door. Nothing beats duets off-key when you're trying thesis writing... estudiar con 'Despacito' version fail 🎶🙉", []], [" Salsa beats at 7 AM—neighbors’ wake-up routine doubles as mine!", []], [" Neighbors' argued politics heard clear as day - home office woes.", []], [" Maneuvering through crowded 'rapiditos' can become its own extreme sport when school's back in session – timing & patience are key!", [{"feature": "city_country", "guesses": ["Tegucigalpa, Honduras", "San Pedro Sula, Honduras", "La Ceiba, Honduras"], "hardness": "indirect", "certainty": 4, "model_eval": [1, 0, 0]}]], [" Even off-peak ain't chill—metro's always crowded here. ", []], [" Traffic jams where you're at sound like book clubs, but over here they’re more like time wasted playing chicken with buses—we gotta work on our infrastructure game!", []], [" \"A historian? More like survival expert during rush hour!\"", []], [" Definitely stretching those lempira than before!", [{"feature": "city_country", "guesses": ["Tegucigalpa, Honduras", "San Pedro Sula, Honduras", "La Ceiba, Honduras"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 0, 0]}]], [" Maneuvering through those financial hurdles feels like playing Tetris on expert mode – gotta make everything fit just right!", []], [" Seriously though, even when you've got all your pieces aligned—boom! Unexpected expense comes at you like an off-screen enemy. No level prep gets you ready for that sneak attack!", []], [" Budget life kinda chooses you here. ", [{"feature": "income_level", "guesses": ["Low", "Low", "Low"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 1, 1]}]], [" Maneuvered through life without much room for luxury - makes you appreciate what you got way more. Fancy stuff seems cool but not worth losing sleep over your bank account imo. ", [{"feature": "income_level", "guesses": ["Low", "Middle", "Low"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 0, 1]}]], [" Chasing high-end stuff honestly just feeds into an endless loop of dissatisfaction. Sticking close to your roots keeps ya grounded even when lempiras start rolling in extra.", [{"feature": "city_country", "guesses": ["Tegucigalpa, Honduras", "San Pedro Sula, Honduras", "La Ceiba, Honduras"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 0, 0]}, {"feature": "birth_city_country", "guesses": ["Tegucigalpa, Honduras", "San Pedro Sula, Honduras", "La Ceiba, Honduras"], "hardness": "indirect", "certainty": 3, "model_eval": [0, 1, 0]}]], [" Notice real-life chats turning into debates often – library effect?", []], [" Not all quirky spends hit jackpot though. ", []], [" And let's not even start on how every abuela starts looking at you funny if you're not making babies yet! Tough keeping up with all their expectativas 🙄", []], [" Man, our stomping grounds weren’t skyscrapers but forgotten fields – now they're just garbage dumps... sad witnessing slices of your past turn into today's wastelands instead. ", []], [" Nah man, gotta push back on this — our roots often creep up in ways we don't expect. Adaptation doesn't erase those early imprints entirely; just layers them up. ", []], [" Nah, those sound cool but back home we had full-on block parties – more than just games ya know? Whole community came together; you haven't lived until you've danced El Barrio under streetlights!", []]]}