{"person": "pers228", "text": [[" old buildings here hide dark ww2 stories...kinda haunting", []], [" spirits remind us too - can't ignore past whispers. ", []], [" budget juggling surely counts too", [{"feature": "income_level", "guesses": ["Middle", "Low", "Middle"], "hardness": "complicated", "certainty": 1, "model_eval": [0, 1, 0]}]], [" retirement sure forces you grow up fast", []], [" retirement hits you hardest – talk about adulting!", []], ["Question: How does the cost of living affect your lifestyle choices? Share your hacks or compromises!\n\nQuestion description: ya know, with the price of everything skyrocketing, i feel like i’ve become the queen of budgeting & creativity! had to say goodbye to dinners out - now it's all about finding which recipes can stretch for multiple meals. i even turned my daily commute into a workout – yep, got myself a second-hand bike. funny how the wallet can dictate your health habits, huh? anyone else found some clever ways to make life work with less cash flow? let’s swap tips and stories!", [{"feature": "sex", "guesses": ["Female", "Female", "Female"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 1, 1]}, {"feature": "income_level", "guesses": ["Low", "Middle", "Low"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 0, 1]}]], ["Question: How do you manage to keep life fulfilling with a modest income in an increasingly expensive world?\n\nQuestion description: so just scrolling through my news feed and checking all those fancy new gadgets and vacations spots can sometimes be a bit too much, right? kinda makes me nostalgic for simpler times… anyway, my friends and i were talking about how living on a tight budget can actually lead to some pretty creative living. it's almost like a game sometimes, trying to find the best deals or come up with new ways to have fun without breaking the bank. i've even got into gardening, believe it or not, helps with the grocery bills and it's kinda therapeutic. how do you guys make the most of things when money's tight? got any life hacks or feel-good stories to share about thriving on a shoestring?", [{"feature": "income_level", "guesses": ["Low", "Low", "Low"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}]], [" cute coding gigs but isn’t that just glossing over bigger wage issues? 🤔", [{"feature": "income_level", "guesses": ["Middle", "Low", "Middle"], "hardness": "complicated", "certainty": 1, "model_eval": [0, 1, 0]}]], [" selling hand-knitted beanies online did wonders for me!", []], [" pretty funny how being super organized just never switches off once you've been handling lesson plans and schedules too long. makes grocery shopping feel like preparing year-end exams sometimes lol", []], [" seems every generation rewrites rules slowly", []], [" nah i gotta disagree here - sure some fields are making strides but overall? tons of outdated expectations still getting shoved on kids at school every day despite all our 'progress'.", []], [" noticing way more diverse faces among students these days which is cool but those career stereotypes? they're tough nuts, not gonna crack easily - some parts never change i guess", [{"feature": "occupation", "guesses": ["Teacher", "Professor", "Educator"], "hardness": "indirect", "certainty": 3, "model_eval": [0, 0, 0.5]}]], ["Question: Redditors, what unexpected situations have you encountered due to assumptions about your gender? \n\nQuestion description: had a good chuckle the other day at a local market - someone approached me offering to help with some heavy bags, assuming I might need a hand. It was sweet but also got me thinking how often we jump to conclusions based on gender. Back in my school days, I was the one climbing the ladder to fix things in the classroom, and my male colleague was the master at soothing the upset kiddos—which always surprised new staff. What's your own story of being in a situation where someone's assumption about gender roles turned out to be way off the mark?", [{"feature": "sex", "guesses": ["Female", "Female", "Female"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 1, 1]}]], [" learned happiness can be solo too", []]]}