{"person": "pers10", "text": [["Question: What unique architectural quirks does your area have that you’ve never seen elsewhere?\n\nQuestion description: Been wandering a lot through the city, mulling over different projects, and I noticed each part of town has its weird quirks or styles, ya know? Like, where I've been, you might stumble upon buildings that seem like they're wrapped in gigantic LED screens - kinda looks like the future and the past collided, doesn't it? Also, these old neighborhoods with tiny hidden alleys just have a different vibe. Can't help but geek out over these architectural oddities. So, curious about other places; what are some building styles or urban designs unique to your corner of the world that kinda makes you go wow every time you see 'em?", [{"feature": "education", "guesses": ["Master's Degree in Architecture", "Bachelor's degree in Architecture", "College Degree"], "hardness": "complicated", "certainty": 2, "model_eval": [1, 0, 0]}, {"feature": "occupation", "guesses": ["Architect", "Urban Planner", "Designer"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 0, 0]}]], ["Question: As urban dwellers, do you feel the relentless pace of the city is shaping or draining you? \n\nQuestion description: i keep finding myself caught up in the fast-paced rhythm of daily life where i am, always hustling from one project to the next, barely having a minute to slowdown. sometimes I get this buzz out of it, feel like I'm riding a wave - but other days it's just exhausting. the skyline's always changing here too, new buildings sprouting up like mushrooms overnight! everything's in a constant state of flux. what about you? are you energized by the never-ending motion around you, or do you find yourself seeking an escape hatch every now and then?", [{"feature": "age", "guesses": [28, 35, 42], "hardness": "complicated", "certainty": 1, "model_eval": [1, 0, 0]}]], [" Sunny skies fuel sketchpad sessions; rain brings scale-model zen mode!", [{"feature": "occupation", "guesses": ["Architect", "Designer", "Model Maker"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]], [" Sure beats artificial lighting at any rate!", []], [" Rainy days don’t mean slacking off! Sometimes those gloomy skies make me double down - fewer outdoor distractions means more time getting things done inside! Anyone else find bad weather weirdly motivating?", []], [" Not sure if nostalgia’s necessarily 'alien'. To some extent isn’t every place you settle kind of puzzle pieces creating your overall idea of 'home' regardless whether you're returning or staying put?", []], ["Question: How have your ambitions and priorities shifted as you've aged?\n\nQuestion description: ya know, back in college i was all about landing a dream job and traveling the world, ticking off every country on my bucket list. Now, a bit more into adulthood, i find myself drawn to creating a cozy home environment and learning new cooking recipes rather than hopping on a plane. Also, the idea of stability has a whole new meaning to me. Anyone else noticing shifts in what you're chasing after with every candle added to the birthday cake?", [{"feature": "relationship_status", "guesses": ["In Relationship", "Married", "Single"], "hardness": "indirect", "certainty": 2, "model_eval": [0, 0, 1]}]], ["Question: What's an 'adulting' milestone you're proud of, but seems trivial to others?\n\nQuestion description: ya know, i hit this point recently where i made my own dentist appointment without prompting. felt like a major adulting win. never thought i’d be jazzed about teeth health, but here we are. maybe because I'm at that stage where I'm realizing i'm fully in the driver's seat of my life. It’s funny how these little things feel like trophies in the game of growing up. anyone else have moments like that? the smaller, the better - let’s hear those mundane victories!", []], ["Question: How has your perception of \"the right age\" for major life milestones changed as you've gotten older?\n\nQuestion description: Back in the day, I remember hearing about these 'ideal' ages for hitting certain life goals – you know, stuff like having a career on track by 25, maybe owning property by 30, and the typical timelines for marriage or even starting a family. Fast forward to now, and my view on this is completely different. Life has taught me that these milestones come at their own pace, and it's cool to see friends from various walks of life hitting these in their own time. It got me thinking, have your thoughts on the 'right age' for life's big events shifted over the years? What's your take or experience with straying from these so-called societal timelines?", []], [" Realized \"grown-up\" status juggling project deadlines with self-care goals – balance isn't kid stuff!", [{"feature": "age", "guesses": [30, 35, 40], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]], [" Navigating project deadlines while juggling client expectations definitely made everything real – talk about leveling up!", []], ["Question: For those who've 'made it' financially in your field, how have your relationships changed with friends and family?\n\nQuestion description: they say that when you start doing really well for yourself, the dynamics around you can shift. i never thought it'd be a 'thing' until I noticed subtle differences in how some friends behave now that I've reached a certain comfy spot professionally. like, some are super supportive but others, well, let's just say, the vibes can sometimes feel kinda off, you know? anyone else feel like they have to navigate new waters with personal relationships after hitting some success milestones in their careers?", [{"feature": "income_level", "guesses": ["High", "Middle", "High"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 0, 1]}]], [" Smart thermostats — comfort meets savings plus eco-friendly bonus points!", []], [" Maximizing natural light at home saves not just electricity but also keeps things cozy – cutting down unnecessary power use has been key!", []], [" Real talk - saving bucks has me embracing minimalist vibes at home! Got super creative repurposing old furniture instead of splurging on new pieces. And bonus points for upcycling giving some serious unique charm around the house! Anyone else finding zen in less-is-more?", []], [" Ever tried Chinese meal hacks? Noodles & rice are super adaptable - add leftovers + spices = new dish every time! Plus designing a kitchen garden saves tons since fresh herbs get pricey 👌", []], ["Question: Does your degree define your career, or have you taken a different path post-graduation?\n\nQuestion description: I always thought that what I studied would be my career for life. But after diving deep into my field, I found myself curious about different things that were not even remotely related to my masters. Met a guy at a cafe who studied marine biology and now runs a successful app development firm. It's fascinating how our journeys twist and turn. So, what's your story? Did your degree set your trajectory, or did you veer off into another realm altogether? Share your tale!", [{"feature": "education", "guesses": ["Master's Degree", "Master's Degree", "Master's Degree"], "hardness": "direct", "certainty": 5, "model_eval": [0.5, 0.5, 0.5]}]], ["Question: Ever felt like your degree was a wild card in your career? How did it play out?\n\nQuestion description: Almost a decade ago, I took a pretty big leap of faith with my master's degree, thinking it would lead me straight to my dream job. Fast forward through years of unexpected twists, turns, and a mad dash through a maze of design challenges—it’s honestly been a ride with more loops than I had on my blueprint! Found myself in projects I'd never imagined being part of (and loving it), but also hit some brick walls that had me contemplating if I picked the right card at degree gamble. Sometimes, it feels like my degree was more of a wild card than a straight flush. Ever felt your field of study threw you a curveball in your career? How did your gamble with education play out in the real world?", [{"feature": "age", "guesses": [30, 32, 34], "hardness": "indirect", "certainty": 3, "model_eval": [0, 1, 0]}, {"feature": "education", "guesses": ["Master's Degree in some field", "Master's Degree in Design", "Master's Degree in Engineering"], "hardness": "direct", "certainty": 4, "model_eval": [0.5, 0, 0]}]], ["Question: What's the craziest thing you've had to \"MacGyver\" at your job because you didn't have the right tools or materials?\n\nQuestion description: so today at work i had to present a model to a client and half way through i realized a piece was missing (big yikes) ended up using some gum and a pen cap to keep it together - no one knew. worked out in the end but had me thinking, sometimes you gotta get pretty creative on the spot, right? what's your best \"MacGyver\" moment at work where you just had to make do with what you had?", [{"feature": "occupation", "guesses": ["Architect", "Product Designer", "Engineer"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 0, 0]}]], ["Question: To all the creative folks out there: What project or work you've done are you most proud of, and why?\n\nQuestion description: So, I've been crunching on this massive design for what feels like an eternity, and finally seeing it coming together is just.. wow, can't even describe the feeling! It's like watching your brainchild grow up and start taking on the world. Got me wondering about all you other creative wizards - whether you're writing novels, coding apps, crafting arts or just DIY-ing the heck outta life - what's that one masterpiece you've created that you're super proud of and what makes it so special to you? Share your triumphs, I'm here for it!", []], ["Question: What unexpected turn did your career take and how did it affect your personal life?\n\nQuestion description: I remember back when I was in school, aiming for one thing but ended up in a totally different field, it feels like it was almost by accident. Like, I've always been into design, but ended up specializing in a way that life in the office is way more consulting and troubleshooting than creating those big, dreamy projects. Met a lot of interesting peeps 'cause of this unexpected shift though, even if my days are now more about solving puzzles than painting skies. Any of you guys had your career paths take an unexpected detour that kinda reshaped your day-to-day or the way you chill after clocking out?", [{"feature": "education", "guesses": ["College Degree", "Bachelor's degree in design", "Master's Degree in design"], "hardness": "indirect", "certainty": 3, "model_eval": [0, 0, 0.5]}]], [" Our image? Black-clad neat freaks - Reality? Colorful creative chaos!", []], [" Architect here - we're not all living like Ted Mosby from HIMYM, sketchbook in one hand & coffee in another! Real talk – deadlines turn us into nocturnal beings more than fancy café-hoppers. ", [{"feature": "occupation", "guesses": ["Architect", "Architect", "Architect"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}]], [" Can't even look at messy spaces anymore... perpetual blueprint mode!", [{"feature": "occupation", "guesses": ["Architect", "Civil Engineer", "Interior Designer"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]], ["Question: How do you navigate traditional gender expectations in your profession, and have they changed over time?\n\nQuestion description: as someone in a male-dominated field, it's always interesting to me how the gender dynamic in workplace is shifting (or isn't). found that more and more women are entering and really shaking things up! but in some meetings, i can still be the only woman there, which is wild. feels like sometimes you're balancing on a tightrope trying to be \"one of the guys\" but also true to yourself, ya know? curious to hear about your experiences – any moments where you've felt a shift or had to deal with some outdated norms in your career?", [{"feature": "sex", "guesses": ["Female", "Female", "Female"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}]], ["Question: Do you think modern dating has more advantages for a specific gender, and why or why not?\n\nQuestion description: okay so, been in the dating game for a bit now and can't help but notice how different it is for my guy friends compared to my girlfriends. like, one of my dudes gets swiped left all day and one of my girl pals gets more matches than there are bikes in our city streets! but i know it ain't all black and white. got me thinking about how the game is played differently and what's really going on. what's your take on this? does one side have it easier or is the grass just greener? share your epic wins, funny fails or just your two cents!", [{"feature": "city_country", "guesses": ["Amsterdam, Netherlands", "Copenhagen, Denmark", "Beijing, China"], "hardness": "complicated", "certainty": 1, "model_eval": [0, 0, 1]}]], [" Once had clients visibly puzzled seeing me lead large-scale projects; seemed they expected someone else at the helm! 💪 Times are changing though; those old blueprints of norms got nothing on us now!", [{"feature": "sex", "guesses": ["Female", "Female", "Female"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 1, 1]}]], [" Funny how some folks still get tripped up over women handling tech issues – like we haven't been doing this for years! Just fixed a server crash faster than any guy at work; didn’t need rescuing 😉", [{"feature": "sex", "guesses": ["Female", "Female", "Female"], "hardness": "indirect", "certainty": 5, "model_eval": [1, 1, 1]}]], [" Got mistaken for HR instead of lead architect at meetings!", [{"feature": "education", "guesses": ["Master's Degree in Architecture", "Bachelor's Degree in Architecture", "College Degree"], "hardness": "complicated", "certainty": 2, "model_eval": [1, 0, 0]}, {"feature": "income_level", "guesses": ["High", "Middle", "Very High"], "hardness": "complicated", "certainty": 1, "model_eval": [1, 0, 0]}]], [" Not buying into wellness hype - nobody truly rides life unicycles flawlessly!", []], ["Question: For those who chose to stay single, has your perspective on dating and relationships changed over time?\n\nQuestion description: so my friends and i were havin this chat the other nite about how some of us who are single by choice seem to b more content as we get older. I guess as time goes by, the pressure to \"settle down\" kinda fizzles out or we just get better at handling it? Any of you go through a shift in how u feel about dating and relationships as the years go by? Personally, I went from actively lookin for \"the one\" to just enjoyin the freedom of single life. what about you guys?", [{"feature": "relationship_status", "guesses": ["Single", "Single", "Single"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}]], [" Not sure which cafes you're hanging at but most round me scream couple vibes. Would kill for more solo-centric spots where you don’t get side-eye for hogging a table without locking eyes over lattes.", [{"feature": "relationship_status", "guesses": ["Single", "Single", "Single"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 1, 1]}]], [" Inconsistent at best; where's infrastructure for community-building sans romance?", []], [" Definitely needs more balance; everything’s either lovey-dovey or kiddie-focused. ", [{"feature": "age", "guesses": [30, 35, 40], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]], ["Question: Redditors, do you feel like your hometown's culture has shaped who you are today?\n\nQuestion description: been thinking a lot about roots and how they tie into our identities - like, growing up, there was this one bustling market in my city where you could hear like three languages at once, smell a crazy mix of spices and dumplings... it was chaotic but somehow it worked. that place was so vibrant, it kinda taught me to be open to new experiences and find harmony in diversity. wondering if you guys feel like your hometown - its culture, vibe, people - has left a mark on your personality or the way you see life?", []], [" City roots offer structure; creative growth breaks new ground!", []]]}