{"person": "pers152", "text": [[" Career too shapes where we call 'home'.", []], [" the hustle becomes kinda comforting when it’s all linked to your grind and ambitions - like picking your neighborhood based on vibe more than convenience now", [{"feature": "income_level", "guesses": ["Middle", "Middle", "Middle"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 1, 1]}]], [" definitely agree - it’s those little familiar details that count now. ", []], [" started tutoring in uni basics - pretty decent side cash.", []], ["  not ideal but hey, gotta adapt right? making bank where you can beats struggling WINAPI", []], [" always double-checking building structures now even when just walking around", []], [" Had an odd job once where they splurged on ghost hunting gear for new building site—apparently hauntings aren’t great for business...", []], [" definitely seeing more diversity at job sites lately - both good progress for us.kode", [{"feature": "occupation", "guesses": ["Construction Worker", "Engineer", "Architect"], "hardness": "indirect", "certainty": 2, "model_eval": [0, 0.5, 0]}]], [" academia’s slow but construction's shaking off old stereotypes too", [{"feature": "education", "guesses": ["In College", "College Degree", "Master's Degree"], "hardness": "indirect", "certainty": 2, "model_eval": [0, 0.5, 0]}]], [" more women in construction but still fight for equal respect", []], [" more women at site but mindset shifts slower than policy", []], [" lotsa spots here where being solo feels just right - no 'couples only' vibes.", [{"feature": "relationship_status", "guesses": ["Single", "Single", "Single"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 1, 1]}]], [" solo gaming nights at cafes tho? unbeatable here", []], [" not sure those 'right' vibes last tbh, even some chill cafes turn into date night central after dark - marketing's slick like that huh? always read between lines for true color of any spot 😒", []], ["  not everyone wants family-style setups; diverse options needed imo", [{"feature": "relationship_status", "guesses": ["Single", "Single", "Single"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 1, 1]}]], [" noticed massive cultural shifts more than landscape changes tbh", []]]}