{"person": "pers166", "text": [[" Studio background noise feels like family chatter now. ", []], [" Teaching high notes = Realizing you're shaping futures... Major wake-up call! ", [{"feature": "occupation", "guesses": ["Music Teacher", "Vocal Coach", "Choir Director"], "hardness": "direct", "certainty": 5, "model_eval": [1, 0, 0]}]], [" Student performance disasters? Now *that’s* unwelcome maturation fast-track. ", [{"feature": "occupation", "guesses": ["Teacher", "Professor", "School Administrator"], "hardness": "indirect", "certainty": 2, "model_eval": [0.5, 0, 0]}]], [" Cutting back too - streaming concerts instead of tickets!", [{"feature": "income_level", "guesses": ["Middle", "Middle", "Middle"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 1, 1]}]], [" Meal prepping - saves money *and* time!", [{"feature": "relationship_status", "guesses": ["Single", "In Relationship", "Married"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}, {"feature": "income_level", "guesses": ["Middle", "Low", "Middle"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 1]}]], [" Swapping scoresheets at local jam sessions – musical thriftiness!", []], [" Street performances - live music feeds the soul!", []], [" Libraries - unreal how much entertainment's there!", []], [" Tough gig juggling scales and social life—clear boundaries are key, plus maybe someone who digs impromptu serenades at odd hours!", []], ["  Late-night jam sessions over lesson plans are routine here!", []], [" Had students surprise many thinking girls can't rock electric guitars!", [{"feature": "occupation", "guesses": ["Music Teacher", "Guitar Instructor", "Music Educator"], "hardness": "indirect", "certainty": 4, "model_eval": [1, 0, 1]}]], [" Piano tuning? They assumed tech crew over musician every time.", []], ["Question: Singles of Reddit, how has being unattached influenced your personal growth and hobbies?\n\nQuestion description: so here's the thing, since i've been riding solo, i've noticed my interests evolving in unexpected ways. used to be all about going out, trying to impress, you know the drill. but lately, something's changed. i’ve fallen back in love with music, expanding my horizons way beyond what i ever expected. picked up the guitar, started writing tunes, even thought about sharing them online. on the flip side, some of my mates seem to be all about that relationship life, and their hobbies took a backseat. it got me wondering – others flying solo – have you found yourself diving deeper into hobbies or finding new ones because of your relationship status? what's your passion project right now?", [{"feature": "relationship_status", "guesses": ["Single", "Single", "Single"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}]], ["Question: Singles of Reddit, how do you respond to the \"When are you going to settle down?\" question at family gatherings? \n\nQuestion description: Being happily single has its peaks. Like, a lot of freedom and extra cash for hobbies. Buut, every family gathering, there's always that one relative or, heck, even a close friend who drops the \"when are you settling down?\" bomb. Got me thinking about how others handle this. Do you guys have a go-to witty comeback, or do you get into deep philosophical explanations about modern love and individualism? Share the tactics you use to parry those well-meaning, but kinda personal probes.", [{"feature": "relationship_status", "guesses": ["Single", "Single", "Single"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}, {"feature": "income_level", "guesses": ["Middle", "High", "Low"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]]]}