{"person": "pers158", "text": [[" Childhood officially ended when the ink dried on divorce papers; reality hit like a lorry – standing solo turns you adult pretty fast!", [{"feature": "relationship_status", "guesses": ["Divorced", "Divorced", "Divorced"], "hardness": "direct", "certainty": 5, "model_eval": [1, 1, 1]}]], [" Always hear we're 'listening gurus'. Funny thing though - catch me zoning out during long meetings like anyone else!", [{"feature": "occupation", "guesses": ["Therapist", "Counselor", "Human Resources Professional"], "hardness": "indirect", "certainty": 2, "model_eval": [1, 0, 0]}]], [" Schedules clash; sometimes solo dinner becomes habit not choice.", []], [" Can't escape it - catch myself unpicking people's choice of words like puzzle pieces during chats. Makes for lively banter though!", []], [" Dead right! Society has us racing against some fairy tale clock – barely makes sense if we all live different stories. Just because the calendar flips doesn't mean you've got all those 'adulthood' boxes ticked off automatically – or ever need to!", [{"feature": "age", "guesses": [30, 35, 40], "hardness": "complicated", "certainty": 2, "model_eval": [0, 1, 0]}]], [" Definitely progressing; still room for improvement though!", []], [" Totally noticed a uptick in dudes joining the therapy game recently—diversity's definitely shaking things up over here too.", [{"feature": "occupation", "guesses": ["Therapist", "Counselor", "Mental Health Professional"], "hardness": "indirect", "certainty": 3, "model_eval": [1, 0, 0.5]}]], [" Gendered job prep? Schools finally taking action over rhetoric!", []], [" Sparks may ignite the flame, but it's sharing values that keeps it burning through any weather!", []], [" Evolved expectations just part of life’s growth.", []], [" Been there too - life's thrown its fair share lessons at me. True lasting bonds are part art form requiring growth together despite hiccups along the way!", [{"feature": "relationship_status", "guesses": ["Married", "In Relationship", "Divorced"], "hardness": "indirect", "certainty": 2, "model_eval": [0, 0, 1]}]]]}